Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/financial_institutions/opening_and_switching_a_bank_account.html.txt.tmx
Source language: en
Languages: ga

source: Opening and switching a bank account
ga: Ag oscailt cuntas bainc agus ag athrú cuntas bainc

source: Financial institutions such as banks, credit unions and building societies provide a range of accounts
ga: Cuireann institiúidí airgeadais, ar nós banc, comhair chreidmheasa agus cumainn foirgníochta réimse cuntas ar fáil

source: There are generally 2 main categories of account; a current account and a deposit account:
ga: Is gnách go mbíonn 2 phríomhchatagóir cuntais ann; cuntas reatha agus cuntas taisce:

source: • A current account allows you to make day-to-day transactions (for example, paying a bill or getting your salary paid directly to the account)
ga: • Tugann cuntas reatha deis duit idirbheartaíochtaí a dhéanamh ó lá go lá (mar shampla, bille a íoc, do thuarastal a fháil díreach chuig an gcuntas, idirbheartaíochtaí a dhéanamh srl.)

source: These are offered only by banks and building societies
ga: Is bainc agus cumainn foirgníochta amháin a chuireann iad sin ar fáil

source: • A deposit account allows you to build up savings and you may earn interest on this money
ga: • Tugann cuntas taisce deis duit cur le hairgead a bheidh i dtaisce agat agus d'fhéadfá ús a shaothrú ar an airgead sin

source: These are offered by most financial institutions
ga: Tairgeann formhór na gcomhlachtaí seirbhíse airgeadais iad sin

source: Some accounts offer you free services, but this depends on the type of account you have
ga: Cuireann roinnt cuntas seirbhísí saor in aisce ar tairiscint duit, ach braitheann seo ar an saghas cuntais atá agat

source: For example, with some banks, you may have to keep an amount of money in your account at all times
ga: Mar shampla, le roinnt banc, d’fhéadfadh go mbeadh ort méid airgid a choimeád i do chuntas ag gach tráth

source: If you earn interest on savings then you may have to pay a tax on the interest called Deposit Interest Retention Tax (DIRT)
ga: Má thuilleann tú ús ar choigiltis, d’fhéadfadh go mbeadh ort cáin a íoc ar an ús, ar a dtugtar Cáin Choinneála ar Ús Taisce (DIRT)

source: The Competition and Consumer Protection Commission has a useful tool which compares the costs and benefits of various financial products
ga: Tá ag an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí uirlis áisiúil a chuireann costais agus sochair tháirgí éagsúla airgeadais i gcomparáid lena chéile

source: Opening a bank account
ga: Ag oscailt cuntas bainc

source: When you open a current account you should be aware of the services the account offers
ga: Nuair a osclaíonn tú cuntas reatha ba chóir duit a bheith ar an eolas faoi na seirbhísí a bheidh agat ar an gcuntas seo

source: You should also find out what the fees and charges for the account are. You can get more detailed information on what to ask about when deciding on a current account from the Competition and Consumer Protection Commission – see 'Where to apply' below
ga: Féadfaidh tú teacht ar fhaisnéis níos sonraí ar céard is ceart fiafraí faoi nuair a bhíonn cinneadh á dhéanamh agat ar chuntas reatha ón gCoimisiún um Iomaíocht agus Cosaint Tomhaltóirí – féach 'Cá háit a ndéanfaidh mé iarratas’ thíos

source: When you open a deposit account you should know what rate of interest you may earn on your savings
ga: Nuair a osclaíonn tú cuntas éarlaise, ba cheart duit fios a bheith agat cén ráta úis a thuillfidh tú ar do chuid coigiltí

source: You should also find out how you can access your money should you need it
ga: Ba cheart a dheimhniú, chomh maith, conas is féidir leat rochtain a fhail ar d'airgead sa chás go dteastódh sé uait

source: A deposit account is not your only option – you can save money in other ways, for example, through An Post
ga: Ní cuntas taisce an t-aon rogha atá agat – féadfaidh tú airgead a shábháil ar bhealaí eile, mar shampla, tríd an bPost

source: A financial institution must establish your identity and verify your address before you can open a bank account
ga: Ní mór d’institiúid airgeadais d’aitheantas agus do sheoladh a dheimhniú sular féidir leat cuntas bainc a oscailt

source: You may want to switch your account to another financial institution because:
ga: D’fhéadfadh go dteastódh uait do chuntas a athrú chuig institiúid eile airgeadais mar gheall ar an méid a leanas:

source: • Your circumstances may have changed and you may have different needs from an account
ga: • Tá do chuid cúinsí athraithe agus tá riachtanais difriúla ag teastáil uait ó chuntas

source: • You may have found an account that offers you a better deal
ga: • B’fhéidir gur aimsigh tú cuntas a thug margadh ní b’fhearr duit

source: • You may be unhappy with the level of service that your bank is providing
ga: • B’fhéidir nach bhfuil tú sásta leis an leibhéal seirbhíse a bhfuil do bhanc á chur ar fáil

source: • You may be unhappy with the fees your bank is charging
ga: • B’fhéidir nach bhfuil tú sásta leis na táillí a bhfuil do bhanc á ghearradh

source: If you decide to switch your account you can get information to help you decide and there are rules governing the process
ga: Má chinneann tú chun do chuntas a athrú, féadfaidh tú faisnéis a fháil chun cabhrú leat cinneadh a dhéanamh agus is ann do rialacha a rialaíonn an próiseas

source: The Competition and Consumer Protection Commission has a personal current account cost comparison that may help you to see whether you can get a better deal from another financial institution
ga: Tá ag an gCoimisiún um Iomaíocht agus Cosaint Tomhaltóirí comparáid phearsanta idir costas cuntas reatha a d’fhéadfadh cabhrú leat chun a fheiceáil an féidir leat margadh níos fearr a fháil ó institiúid eile airgeadais

source: If you decide to switch your account, the Central Bank has issued a code of conduct on the switching of current accounts with credit institutions (pdf)
ga: Má chinneann tú chun do chuntas a athrú, d’eisigh an Banc Ceannais cód iompair ar athrú cuntas reatha le hinstitiúidí creidmheasa (pdf)

source: All credit institutions (banks and building societies) in Ireland must comply with the code
ga: Ní mór do gach institiúid chreidmheasa (bainc agus cumainn foirgníochta) in Éirinn an cód a chomhlíonadh

source: Under the code all banks and building societies must provide a switching pack to their customers
ga: Faoin gcód, ní mór do gach banc agus cumann foirgníochta pacáiste aistrithe a sholáthar dá gcustaiméirí

source: This contains a description of all of the current accounts currently being offered to new customers, as well as a step-by-step guide to what you need to do when switching
ga: Cuimsítear ann seo cur síos ar gach ceann de na cuntais reatha atá ar tairiscint ag an tráth sin do chustaiméirí nua, mar aon le treoir céim ar chéim maidir lenar gá duit a dhéanamh nuair a bhíonn tú ag athrú

source: Your new bank or building society must have your new account up and running within 10 working days of the switching date - this is the date agreed between you and your new bank or building society for the process to start
ga: Ní mór go mbeidh do chuntas nua socraithe agus i mbun feidhme ag do bhanc nó do chumann foirgníochta nua laistigh de 10 lá oibre tar éis dháta an aistrithe – seo an dáta lenar comhaontaíodh idir tú féin agus do bhanc nó do chumann foirgníochta nua go dtosóidh an próiseas

source: You will be given the option to keep your old account, or to close it
ga: Tabharfar an rogha duit do sheanchuntas a choimeád nó é a dhúnadh

source: You must let your new bank know before you switch
ga: Ní mór duit do bhanc nua a chur ar an eolas sula n-aistríonn tú

source: If you keep your old account open you may have to pay charges on this account and stamp duty on your cards, even if you no longer use that account
ga: Má choimeádann tú do sheanchuntas ar oscailt, d’fhéadfadh go mbeadh ort muirir a íoc ar an gcuntas seo, mar aon le dleacht stampa ar do chártaí, fiú mura n-úsáideann tú an cuntas sin a thuilleadh

source: You can get detailed information on switching accounts from the Competition and Consumer Protection Commission
ga: Féadfaidh tú faisnéis mhionsonraithe a fháil ar chuntais a athrú ón gCoimisiún um Iomaíocht agus Cosaint Tomhaltóirí
